{
  "python": {
    "label": {
      "name": "Name",
      "function": "Funktion",
      "inputs": "Eingänge",
      "outputs": "Ausgänge"
    },
    "tip": "Tipp: Auf der Registerkarte \"Info\" finden Sie Hilfe.",
    "paletteHelp": "<p>Ein Knoten zum Schreiben von Python-Code, um interessantere Dinge zu tun.</p>",
    "help": "<p>Ein Knoten zum Schreiben von Python-Code, um interessantere Dinge zu tun. Der Knoten startet einen neuen Python-Prozess, der den Code ausführt. Der Prozess läuft kontinuierlich. Es kommuniziert mit Homegear über IPC.</p><p>Wenn eine Nachricht eintrifft, wird die Rückrufmethode für die Knoteneingabe aufgerufen.</p><p>Die Nachricht wird als Python-Dictionary übergeben. Das Dictionary enthält immer mindestens den Eintrag <code>payload</code>. Informationen zum Knoten finden Sie im Dictionary <code>nodeInfo</code>. <code>nodeInfo</code> enthält auch die Umgebungsvariablen. Der Eingabeindex wird in <code>inputIndex</code> übergeben.</p><p>Mit dem Homegear-Objekt <code>hg</code> können Sie RPC-Methoden direkt ausführen. Z.B. <code>hg.setValue(...)</code>.</p><h4>Datenspeicher</h4><p>Daten können durch Aufrufen von <code>hg.setNodeData(Schlüssel, Wert)</code>, <code>hg.setFlowData(Schlüssel, Wert)</code> oder <code>hg.setGlobalData(Schlüssel, Wert)</code> gespeichert und mit <code>hg.getNodeData(Schlüssel)</code>, <code>hg.getFlowData(Schlüssel)</code> oder <code>hg.getGlobalData(Schlüssel)</code> abgerufen werden.</p><h4>Senden von Nachrichten</h4><p>Senden von Nachrichten an eine Ausgabe können Sie <code>hg.nodeOutput(outputIndex, msg)</code> aufrufen.</p> ",
    "input1Description": "Dieses Signal wird an die laufende Python-Instanz übergeben.",
    "input2Description": "Diese Eingabe wird an <code>stdin</code> der Python-Instanz gesendet.",
    "output1Description": "Gibt den Exit-Code und einige zusätzliche Informationen aus, wenn der Python-Prozess beendet ist.",
    "output2Description": "<code>stdout</code> der Python-Instanz.",
    "output3Description": "<code>stderr</code> der Python-Instanz."
  }
}
